Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh11-v3.tmx
Source language: bo
Languages: en

source: ཚུལ་གཅིག་ཅིང་ཐ་དད་པར་མི་བྱེད་པའི་ཤེས་པ་ལ་འཇུག་པས་ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་རྣམས་བསྒོམ་པ་དང་། ཆོས་ཟབ་མོ་ལ་བཟོད་པ་ལ་འཇུག་པས་ཟད་པར་གྱི་སྐྱེ་མཆེད་རྣམས་ལ་སྙོམས་པར་འཇུག་སྟེ།
en: It entails the meditations on the [eight] sense fields of mastery by engaging in the cognition of a single modality, without differentiation, and it entails absorption in the [ten] sense fields of total consummation through acceptance of the nature of profound phenomena.

source: དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་སྙོམས་པར་འཇུག་པ་སྟེ།
en: All these absorptions, too, are cultivated without apprehending anything.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྐྱོན་མེད་པ་ནི་གང་གི་ཚེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ནི། ནང་སྟོང་པ་ཉིད་ལ་ཕྱི་སྟོང་པ་ཉིད་མི་མཐོང་།
en: “Moreover, Śāradvatī­putra, the maturity of a great bodhisattva being also entails those circumstances when bodhisattvas practice the transcendent perfection of wisdom [with regard to the eighteen aspects of emptiness]: In the emptiness of internal phenomena, the emptiness of external phenomena is not discerned.

source: ཕྱི་སྟོང་པ་ཉིད་ལ་ནང་སྟོང་པ་ཉིད་མི་མཐོང་།
en: In the emptiness of external phenomena, the emptiness of internal phenomena is not discerned.

source: ནང་སྟོང་པ་ཉིད་དང་ཕྱི་སྟོང་པ་ཉིད་ལ་སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་མི་མཐོང་།
en: In the emptiness of both external and internal phenomena, the emptiness of emptiness is not discerned.

source: སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་ལ་ནང་དང་ཕྱི་སྟོང་པ་ཉིད་མི་མཐོང་།
en: In the emptiness of emptiness, the emptiness of both external and internal phenomena is not discerned.

source: སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་ལ་ཆེན་པོ་སྟོང་པ་ཉིད་མི་མཐོང་།
en: In the emptiness of emptiness, the emptiness of great extent is not discerned.

source: ཆེན་པོ་སྟོང་པ་ཉིད་ལ་དོན་དམ་པ་སྟོང་པ་ཉིད་མི་མཐོང་།
en: In the emptiness of great extent, the emptiness of ultimate reality is not discerned.

source: དོན་དམ་པ་སྟོང་པ་ཉིད་ལ་འདུས་བྱས་སྟོང་པ་ཉིད་མི་མཐོང་།
en: In the emptiness of ultimate reality, the emptiness of conditioned phenomena is not discerned.

source: འདུས་བྱས་སྟོང་པ་ཉིད་ལ་འདུས་མ་བྱས་སྟོང་པ་ཉིད་མི་མཐོང་།
en: In the emptiness of conditioned phenomena, the emptiness of unconditioned phenomena is not discerned.

source: འདུས་མ་བྱས་སྟོང་པ་ཉིད་ལ་མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་མི་མཐོང་།
en: In the emptiness of unconditioned phenomena, the emptiness of the unlimited is not discerned.

source: མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་ལ། ཐོག་མ་དང་ཐ་མ་མེད་པ་སྟོང་པ་ཉིད་མི་མཐོང་།
en: In the emptiness of the unlimited, the emptiness of that which has neither beginning nor end is not discerned.

source: ཐོག་མ་དང་ཐ་མ་མེད་པ་སྟོང་པ་ཉིད་ལ་དོར་བ་མེད་པ་སྟོང་པ་ཉིད་མི་མཐོང་།
en: In the emptiness of that which has neither beginning nor end, the emptiness of non-dispersal is not discerned.

source: དོར་བ་མེད་པ་སྟོང་པ་ཉིད་ལ་རང་བཞིན་གྱིས་སྟོང་པ་ཉིད་མི་མཐོང་།
en: In the emptiness of non-dispersal, the emptiness of inherent existence is not discerned.

source: རང་བཞིན་གྱིས་སྟོང་པ་ཉིད་ལ་རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་མི་མཐོང་།
en: In the emptiness of inherent existence, the emptiness of all intrinsic defining characteristics is not discerned.

source: རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་ལ་ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་མི་མཐོང་།
en: In the emptiness of all intrinsic defining characteristics, the emptiness of all things is not discerned.

source: ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་ལ་མི་དམིགས་པ་སྟོང་པ་ཉིད་མི་མཐོང་།
en: In the emptiness of all things, the emptiness of non-apprehension is not discerned.

source: མི་དམིགས་པ་སྟོང་པ་ཉིད་ལ་དངོས་པོ་མེད་པ་སྟོང་པ་ཉིད་མི་མཐོང་།
en: In the emptiness of non-apprehension, the emptiness of non-entities is not discerned.

source: དངོས་པོ་མེད་པ་སྟོང་པ་ཉིད་ལ་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་མི་མཐོང་།
en: In the emptiness of non-entities, the emptiness of essential nature is not discerned.

source: ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ལ་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་མི་མཐོང་།
en: In the emptiness of essential nature, the emptiness of the essential nature of non-entities is not discerned.

source: དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ལ་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་མི་མཐོང་བ་སྟེ།
en: In the emptiness of the essential nature of non-entities, the emptiness of essential nature is not discerned.

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱོད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྐྱོན་མེད་པ་ལ་འཇུག་པར་འགྱུར་རོ། །
en: Śāradvatī­putra, great bodhisattva beings who practice the transcendent perfection of wisdom accordingly will engage in the maturity of great bodhisattva beings.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྐྱོན་མེད་པ་ནི་འདི་ལྟ་སྟེ། གཞན་གྱི་དྲིང་ལ་མི་འཇོག་ཅིང་གཞན་ལ་བསྟན་པ་ཤེས་པ་ལ་འཇུག་པས་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ།
en: “Moreover, Śāradvatī­putra, the maturity of a great bodhisattva being also entails the completion of the ten powers of the tathāgatas by encouraging others to understand the teachings without relying on external conditions.

source: དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་བྱེད་པའོ། །
en: These too should be cultivated without apprehending anything.

source: བདག་དང་གཞན་ལ་རློམ་སེམས་མེད་པ་ལ་ལྷག་པར་འཇུག་པས་མི་འཇིགས་པ་བཞི་ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ།
en: It also entails the completion of the four assurances by elucidating [the teachings], without making assumptions with respect to oneself and others.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ཡོངས་སུ་སྤངས་པའི་ཤེས་པས་དེ་ལ་ཡང་རློམ་སེམས་སུ་མི་བྱེད་པས་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ།
en: It further entails the completion of the four kinds of exact knowledge by knowing, without making assumptions, that the vehicles of the śrāvakas and pratyekabuddhas have been rejected.

source: སེམས་ཅན་དང་སེམས་ཅན་མེད་པས་བྱམས་པ་ཆེན་པོ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ།
en: It also entails the completion of great loving kindness by [understanding that] sentient beings are not sentient beings.

source: བདག་བདག་མེད་པས་སྙིང་རྗེ་ཆེན་པོ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ།
en: It also entails the completion of great compassion by [understanding that] the self is not a self.

source: རིག་པ་གཉིས་ཀྱི་བསམ་པ་དང་བྲལ་བས་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ།
en: It further entails the completion of the eighteen distinct qualities of the buddhas through freedom from thoughts associated with the two modes of awareness.

source: རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པའི་སྟོང་པ་ཉིད་ལ་འཇུག་པས་ཐམས་ཅད་ཤེས་པ་ཉིད་དང་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ།
en: “It also entails the completion of the understanding of all phenomena, the understanding of the aspects of the path, and the understanding of omniscience by engaging with emptiness in all its finest aspects.

source: དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་བྱེད་པའོ། །སེར་སྣ་དང་།
en: These too should be cultivated without apprehending anything.

source: འཆལ་བའི་ཚུལ་ཁྲིམས་དང་། ཁྲོ་བ་དང་། ལེ་ལོ་དང་། རྣམ་པར་གཡེང་བའི་སེམས་དང་། འཆལ་བའི་ཤེས་རབ་ཀྱི་སེམས་རྣམས་དངོས་པོ་མེད་པར་མཐོང་བས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ།
en: It entails the completion of the six transcendent perfections by discerning [respectively] that thoughts of miserliness, degenerate morality, agitation, indolence, and distraction, as well as thoughts of stupidity, are non-entities.

source: ཆོས་ཐམས་ཅད་འོང་བ་དང་འགྲོ་བ་མེད་ཅེས་བྱ་བར་མོས་ནས་མངོན་པར་ཤེས་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་བྱེད་པའོ། །ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་དང་།
en: “It also entails the completion of the six extrasensory powers, having resolved that all things neither come nor go.

source: མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་།
en: These too should be cultivated without apprehending anything.

source: སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། འབྱུང་བ་མེད་ཅེས་བྱ་བར་མཐོང་ནས། མིག་ལྔ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ།
en: It entails the completion of the five eyes, having discerned that all things are empty, signless, aspirationless, neither arising nor ceasing, and are neither subject to non-conditioning nor non-origination.

source: ཆོས་ཐམས་ཅད་མི་གནས་པའོ་ཞེས་བྱ་བར་མོས་ནས་མཚན་དང་དཔེ་བྱད་བཟང་པོ་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ།
en: It entails the completion of the major and minor marks, having aspired to [the realization] that all things are non-abiding.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ཇི་ལྟར་ན་བྱང་ཆུབ་ཀྱི་ལམ་དུ་མཆི་ཞིང་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མ་མཆིས་པ་ལ་ཡང་འཇུག་ལ།
en: How do great bodhisattva beings who practice the transcendent perfection of wisdom proceed on the path to enlightenment, and how indeed do they enter into the maturity of the bodhisattvas?

source: སུས་ཀྱང་ཐུལ་བར་རྔོ་མི་ཐོགས་པ་ལགས།
en: Can they not be overcome by anyone?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་གང་གི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ། གཟུགས་ཀྱི་ཕུང་པོར་རློམ་སེམས་སུ་མི་བྱེད་ཅིང་།
en: The Blessed One replied, “Śāradvatī­putra, when great bodhisattva beings practice the transcendent perfection of wisdom, they do not make assumptions about the aggregate of physical forms.

source: དེ་བཞིན་དུ་རྣམ་པར་ཤེས་པའི་ཕུང་པོའི་བར་དུ་རློམ་སེམས་སུ་མི་བྱེད།
en: Similarly, they do not make assumptions about [the other aggregates], up to and including the aggregate of consciousness.

source: མིག་གི་སྐྱེ་མཆེད་དུ་རློམ་སེམས་སུ་མི་བྱེད་ཅིང་། དེ་བཞིན་དུ་ཡིད་ཀྱི་སྐྱེ་མཆེད་ཀྱི་བར་དུ་རློམ་སེམས་སུ་མི་བྱེད།
en: They do not make assumptions about the sense field of the eyes, and similarly, they do not make assumptions about [the other sense fields], up to and including the sense field of the mental faculty.

source: གཟུགས་ཀྱི་སྐྱེ་མཆེད་དུ་རློམ་སེམས་སུ་མི་བྱེད་པ་ནས།
en: They do not make assumptions about the sense field of sights, and they do not make assumptions about [the other sense fields], starting from there and continuing up to the sense field of mental phenomena.

source: ཆོས་ཀྱི་སྐྱེ་མཆེད་ཀྱི་བར་དུ་རློམ་སེམས་སུ་མི་བྱེད། དེ་བཞིན་དུ་མིག་གི་ཁམས་སུ་རློམ་སེམས་སུ་མི་བྱེད། གཟུགས་ཀྱི་ཁམས་སུ་རློམ་སེམས་སུ་མི་བྱེད། མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་སུ་རློམ་སེམས་སུ་མི་བྱེད་པ་ནས།
en: Similarly, they do not make assumptions about the sensory element of the eyes, they do not make assumptions about the sensory element of sights, and they do not make assumptions about the sensory element of visual consciousness.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། ཡིད་ཀྱི་ཁམས་སུ་རློམ་སེམས་སུ་མི་བྱེད། ཆོས་ཀྱི་ཁམས་ཀྱི་བར་དུ་རློམ་སེམས་སུ་མི་བྱེད།
en: And in the same vein, they do not make assumptions about the sensory element of the mental faculty, and they do not make assumptions about [the other sensory elements], up to and including the sensory element of mental phenomena.

source: དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་སུ་རློམ་སེམས་སུ་མི་བྱེད་པ་ནས། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་དུ་རློམ་སེམས་སུ་མི་བྱེད།
en: “They do not make assumptions about the applications of mindfulness, and they do not make assumptions about [the other causal attributes], up to and including the noble eightfold path.

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པར་རློམ་སེམས་སུ་མི་བྱེད་པ་ནས། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་དུ་རློམ་སེམས་སུ་མི་བྱེད། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུར་རློམ་སེམས་སུ་མི་བྱེད།
en: They do not make assumptions about the transcendent perfection of generosity, and they do not make assumptions about the other transcendent perfections, up to and including the transcendent perfection of wisdom.

source: དེ་བཞིན་དུ་མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་དུ་རློམ་སེམས་སུ་མི་བྱེད།
en: Similarly, they do not make assumptions about the ten powers of the tathāgatas, and likewise, they do not make assumptions about the four assurances, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas.

source: དེ་བཞིན་དུ་རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུའི་བར་དུ་རློམ་སེམས་སུ་མི་བྱེད་པ་ནས་དགྲ་བཅོམ་པའི་བར་དུ་རློམ་སེམས་སུ་མི་བྱེད།
en: “Similarly, they do not make assumptions about [their attainments], up to and including the fruit of having entered the stream, and they do not make assumptions about [their other attainments], up to and including arhatship.

source: དེ་བཞིན་དུ་རང་བྱང་ཆུབ་ཏུ་རློ་མ་སེམས་སུ་མི་བྱེད། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་རློམ་སེམས་སུ་མི་བྱེད་པ་སྟེ།
en: Similarly, they do not make assumptions about individual enlightenment, or about unsurpassed, genuinely perfect enlightenment.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་རྣམ་པར་འཕེལ་བ་ན།
en: Śāradvatī­putra!

source: བྱང་ཆུབ་ཀྱི་ལམ་དུ་འགྲོ་ཞིང་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་ལ་ཡང་འཇུག་ལ།
en: If great bodhisattva beings flourish accordingly through the transcendent perfection of wisdom, they will proceed on the path to enlightenment and they will also enter into the maturity of the bodhisattvas.

source: སུས་ཀྱང་ཐུལ་བར་མི་ནུས་པ་ཡིན་ནོ། །
en: They cannot be overcome by anyone!

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ནས། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ། ཤེས་པ་གང་དང་ལྡན་ནམ་ཡང་ངན་སོང་རྣམས་སུ་རབ་ཏུ་མི་ལྟུང་ཞིང་མི་རྣམས་ཀྱི་ནང་དུ་ཉམས་པར་མི་འགྱུར་ལ།
en: “Moreover, Śāradvatī­putra, if great bodhisattva beings who abide in the transcendent perfection of wisdom, and then perfect the gnosis of omniscience, are endowed with that cognition, they will never fall into the lower realms of existence, and they will never be belittled among human beings.

source: དབུལ་པོར་མ་ཡིན་པ་དང་། ལུས་གང་དང་ལྡན་ན་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་གྱི་འཇིག་རྟེན་གྱིས་སྨད་པར་འགྱུར་བའི་ལུས་དེ་ལྟ་བུ་ཡོངས་སུ་འཛིན་ཏོ། །
en: They will never become impoverished, and if they do possess a corporeal form, they will not acquire a body that is censured by the worlds of humans, gods, and antigods.”

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་པ་གང་དང་ལྡན་ན། ནམ་ཡང་ངན་སོང་རྣམས་སུ་མི་ལྟུང་བ་དང་། ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་གྱི་འཇིག་རྟེན་གྱིས་སྨད་པར་མི་འགྱུར་བར་ཤེས་པ་གང་ལགས།
en: If great bodhisattva beings are endowed with the cognition whereby they would never regress into the lower realms of existence and never be censured by the worlds of gods, humans, and antigods, what is that cognition?”

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་པ་གང་དང་ལྡན་ན། ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་མཐོང་ཞིང་དེ་དག་ལས་ཆོས་ཀྱང་ཉན་ལ།
en: If great bodhisattva beings are endowed with that cognition, in the world systems of the eastern direction, which are as numerous as the sands of the River Ganges, they will perceive tathāgatas, arhats, and genuinely perfect buddhas—as numerous as the sands of the River Ganges—and they will listen to the sacred teachings from them.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་། བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ཡང་མཐོང་། སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་དག་ཀྱང་མཐོང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་པ་གང་དང་ལྡན་ན། སངས་རྒྱས་སུ་འདུ་ཤེས་མི་འཇུག ། བྱང་ཆུབ་སེམས་དཔར་འདུ་ཤེས་མི་འཇུག །
en: They will also perceive the community of the śrāvakas and the community of the bodhisattvas who are associated with those lord buddhas, and they will also perceive the arrays of the enlightened attributes of the buddhafields.

source: ཉན་ཐོས་སུ་འདུ་ཤེས་མི་འཇུག །རང་སངས་རྒྱས་སུ་འདུ་ཤེས་པ་མ་ཡིན། བདག་ཏུ་འདུ་ཤེས་པ་མ་ཡིན། བདག་མེད་པར་འདུ་ཤེས་པ་མ་ཡིན། སངས་རྒྱས་ཀྱི་ཞིང་དུ་འདུ་ཤེས་པ་མ་ཡིན་པ་དང་།
en: If great bodhisattva beings are endowed with that cognition, they do not maintain notions regarding the buddhas, they do not maintain notions regarding the bodhisattvas, they do not maintain notions regarding the śrāvakas, they have no notions regarding the pratyekabuddhas, they have no notions regarding self, they have no notions regarding non-self, and they have no notions regarding the buddhafields.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་པ་གང་དང་ལྡན་ན། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཡང་སྤྱོད་ལ། སྦྱིན་པ་དེ་ཡང་མི་དམིགས་པ་ནས། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཡང་སྤྱོད་ལ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དེ་ཡང་མི་དམིགས་པ་དང་།
en: “If great bodhisattva beings are endowed with that cognition, they do practice the transcendent perfection of generosity, but they do not apprehend that generosity, and then they also practice the transcendent perfection of wisdom, but they do not apprehend that transcendent perfection of wisdom.

source: ཤེས་པ་གང་དང་ལྡན་ན། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་མི་དམིགས་པར་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་སྤྱོད་པ་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ།
en: If they are endowed with such cognition, they practice the applications of mindfulness, without apprehending the applications of mindfulness.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་མི་དམིགས་པར་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ལ་སྤྱོད་པ་སྟེ།
en: In the same vein, they practice the eighteen distinct qualities of the buddhas, without apprehending the distinct qualities of the buddhas.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་པ་གང་དང་ལྡན་ན།
en: Śāradvatī­putra!

source: ཆོས་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་རྫོགས་པར་བྱེད་ལ། ཆོས་དེ་དག་ཏུ་ཡང་རློམ་སེམས་སུ་མི་བྱེད་པའི་ཤེས་པ་ཡིན་ཏེ།
en: If great bodhisattva beings are endowed with that cognition, they bring all phenomena to perfection, and they are aware that they do not make assumptions about all these phenomena.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་བྱང་ཆུབ་ཀྱི་ལམ་རྣམ་པར་སྤྱོད་པར་འདོད་པ། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་ལ་འཇུག་པར་འདོད་པས་ལུས་ཀྱི་ལས་དང་། ངག་གི་ལས་དང་། ཡིད་ཀྱི་ལས་ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་དག་གི་སྐབས་དབྱེ་བར་མི་བྱའོ། །
en: “So it is, Śāradvatī­putra, that great bodhisattva beings who practice the transcendent perfection of wisdom, who wish to pursue the path to enlightenment, and who wish to enter into the maturity of the bodhisattvas should have no opportunities to indulge in physical, verbal, and mental actions that are tainted with the inadmissible transgressions.”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་ཆེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then, the venerable Śāradvatī­putra asked the Blessed One, “Reverend Lord!

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལུས་ཀྱི་ལས་ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་གང་ལགས།
en: What are the physical actions that are tainted with the inadmissible transgressions, which great bodhisattva beings might have?

source: ངག་གི་ལས་གང་ལགས། ཡིད་ཀྱི་ལས་གང་ལགས། དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: What are the corresponding verbal actions, and what are the corresponding mental actions?”

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་འདི་སྙམ་དུ་སེམས་ཏེ། ལུས་གང་གིས་བདག་ལུས་ལ་དམིགས་པར་བྱའོ་སྙམ་པའི་ལུས་དེ་འདི་ཡིན་ནོ་སྙམ་པ་དང་། དེ་བཞིན་དུ་ངག་དེ་འདི་ཡིན་ནོ་སྙམ་པ་དང་། དེ་བཞིན་དུ་ཡིད་དེ་འདི་ཡིན་ནོ་སྙམ་པ་དང་། ཡིད་གང་གིས་བདག་ཡིད་ལ་དམིགས་པར་བྱའོ་སྙམ་པའི་ཡིད་དེ་འདི་ཡིན་ནོ་སྙམ་པ་སྟེ།།ཤ་ར་དྭ་ཏིའི་བུ་དེ་ནི་ལུས་ཀྱི་ལས་དང་། ངག་གི་ལས་དང་། ཡིད་ཀྱི་ལས་ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་ཡིན་ནོ། །
en: The Blessed One then addressed the venerable Śāradvatī­putra as follows: “Śāradvatī­putra, when great bodhisattva beings think, ‘This is the body on the basis of which the self is to be apprehended as the body,’ or similarly, ‘This is the speech [on the basis of which the self is to be apprehended as speech],’ or ‘This is the mind on the basis of which the self is to be apprehended as the mind,’ Śāradvatī­putra, all that denotes physical actions, verbal actions, and mental actions that are tainted with the inadmissible transgressions.

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ནི། ལུས་ཀྱང་མི་དམིགས་པ་ཡིན་ནོ། །ཤ་ར་དྭ་ཏིའི་བུ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ། ལུས་དམིགས་ལ། ལུས་སམ། ངག་གམ། ཡིད་གང་གིས་སེར་སྣའི་སེམས་སྐྱེད་པར་བྱེད་ཅིང་། འཆལ་བའི་ཚུལ་ཁྲིམས་ཀྱི་སེམས་སམ། འཁྲུག་པའི་སེམས་སམ། ལེ་ལོའི་སེམས་སམ།
en: However, Śāradvatī­putra, great bodhisattva beings who practice the transcendent perfection of wisdom do not at all apprehend the physical body [and so forth].

source: རྣམ་པར་གཡེངས་པའི་སེམས་སམ། འཆལ་བའི་ཤེས་རབ་ཀྱི་སེམས་སྐྱེད་ན། ཤ་ར་དྭ་ཏིའི་བུ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མ་ཡིན་པར་རིག་པར་བྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན། ལུས་ཀྱི་གནས་ངན་ལེན་སྦྱོང་བར་བྱེད།
en: Śāradvatī­putra, if great bodhisattva beings who practice the transcendent perfection of wisdom were to apprehend the physical body [and so forth], and in doing so were to generate through their body, speech, or mind thoughts of miserliness, and if they were to generate thoughts of degenerate morality, thoughts of agitation, thoughts of indolence, thoughts of distraction, or thoughts of stupidity, then, Śāradvatī­putra, one should know that they would not be great bodhisattva beings.

source: ངག་གི་གནས་ངན་ལེན་སྦྱོང་བར་བྱེད། ཡིད་ཀྱི་གནས་ངན་ལེན་སྦྱོང་བར་བྱེད་ན། དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ། བྱང་ཆུབ་ཀྱི་ལམ་རྣམ་པར་སྦྱོང་ཞིང་། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་ལ་ཡང་དག་པར་འཇུག་པ་ཡིན་ནོ། །
en: “Śāradvatī­putra, if great bodhisattva beings practice the transcendent perfection of wisdom, they will purify the negativity of body, and if they also purify the negativity of speech, and purify the negativity of mind, it follows that those great bodhisattva beings who practice the transcendent perfection of wisdom will refine the path to enlightenment, and correctly enter into the maturity of the bodhisattvas.”

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལུས་ཀྱི་གནས་ངན་ལེན་སྦྱོང་བ་ལགས།
en: How do great bodhisattva beings purify the negativity of body?

source: དེ་བཞིན་དུ་ཇི་ལྟར་ན་ངག་དང་ཡིད་ཀྱི་གནས་ངན་ལེན་སྦྱོང་བ་ལགས།
en: Similarly, how do they purify the negativity of speech and mind?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལུས་མི་དམིགས། ངག་དང་ཡིད་མི་དམིགས་ཤིང་། ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་དང་པོ་བསྐྱེད་པ་ནས་བཟུང་སྟེ། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་ཡང་དག་པར་བླངས་ནས་གནས་ལ།
en: The Blessed One replied, “Śāradvatī­putra, whenever great bodhisattva beings do not apprehend the physical body and do not apprehend speech and mind, then, Śāradvatī­putra, these great bodhisattva beings continue to pursue the paths associated with the ten virtuous actions, from the time when they first begin to set their mind on enlightenment.

source: ནམ་ཡང་ཉན་ཐོས་ཀྱི་སེམས་སམ། རང་སངས་རྒྱས་ཀྱི་སེམས་མི་སྐྱེད་ཅིང་། སེམས་ཅན་ཐམས་ཅད་ལ་ཡང་རྟག་པ་ཁོ་ནར་སྙིང་རྗེ་ཆེན་པོ་སྐྱེད་པར་བྱེད་པ་སྟེ།
en: They never develop the mindsets of the śrāvakas and pratyekabuddhas, but they do indeed develop great compassion at all times for the sake of all sentient beings.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལུས་ཀྱི་གནས་ངན་ལེན་ཡོངས་སུ་དག་པར་སྨྲའོ། །
en: “Accordingly, Śāradvatī­putra, I say that great bodhisattva beings who practice the transcendent perfection of wisdom will purify the negativity of body.

source: དེ་བཞིན་དུ་ངག་དང་ཡིད་ཀྱི་གནས་ངན་ལེན་ཡོངས་སུ་དག་པར་སྨྲའོ། །
en: Similarly, I say that they will purify the negativity of speech and mind.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ། བྱང་ཆུབ་ཀྱི་ལམ་སྦྱོང་བར་བྱེད་ཅིང་། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་ལ་ཡང་འཇུག་པ་ཡིན་ནོ། །
en: Śāradvatī­putra, so it is that great bodhisattva beings who practice the transcendent perfection of wisdom refine the path to enlightenment, and also enter into the maturity of the bodhisattvas.”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཁྲི་པ་ལས་སྐྱོན་མེད་པའི་ལེའུ་ཞེས་བྱ་སྟེ་བརྒྱད་པའོ། །
en: This completes the eighth chapter from “The Transcendent Perfection of Wisdom in Ten Thousand Lines,” entitled “Maturity.”
